---
kind: type
id: T:Autodesk.Revit.DB.ImportUnit
source: html/7801f4fd-83aa-65b4-5cd9-d3564d48f147.htm
---
# Autodesk.Revit.DB.ImportUnit

An enumerated type listing possible target units for CAD Import.

## Syntax (C#)
```csharp
public enum ImportUnit
```